#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
aws_route53_zone.main: Refreshing state... [id=Z08584092PBMPMW8T02TQ]
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_ami.amazon-linux-2023: Reading...
aws_ecr_repository.ecr: Refreshing state... [id=flask]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/flask-cluster/cluster]
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=776410366842]
data.aws_region.current: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=776410366842]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ea76ccf56c14a6fb]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=776410366842]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=776410366842]
aws_iam_role.role2: Refreshing state... [id=eks-role]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=flask-cluster-cluster-20240125233117146000000002]
module.eks.module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20240125233117146100000003]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::776410366842:assumed-role/gha_oidc_assume_role/terraformdeploy]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20240125233117146100000003-20240125233117468800000004]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20240125233117146100000003-20240125233117478800000005]
module.eks.module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20240125233117146100000003-20240125233117483000000006]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=flask-cluster-cluster-20240125233117146000000002-20240125233117619600000007]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=flask-cluster-cluster-20240125233117146000000002-20240125233117624400000008]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1325957121]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=aa338f0a-1cc8-441f-9825-a7f3675581c7]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/flask-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::776410366842:policy/flask-cluster-cluster-ClusterEncryption2024012523313351970000000b]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=flask-cluster-cluster-20240125233117146000000002-2024012523313377250000000c]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0ca6d18169181b68a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c45d88270052c97a]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-048501b3ad6b608ab]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0c5a9e1fbd79ec73b]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0adf72fde51a76eab]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-00fa4d0b4baa6013c]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-02a7f82951a37d6a2]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0b3430fd140be6e10]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f645e8f1c6d40e8a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-048d72a0e90d89be0]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-08a019a34941df068]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-077deb2d4d4bee259]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c1ea2827e52274c7]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0da17c96d1d074ad0]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08f79f434ba4603a0]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a0b25c00fe9a7110]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-077deb2d4d4bee2591080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-055e330865568d945]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0a8a50b6147d02199]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e4342567706e33ee]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07204bc882fdf0bc9]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fddea33f960e35c0]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-009f6bf7ecd0421e1]
data.aws_ami.amazon-linux-2023: Read complete after 1s [id=ami-0bb6cbb99aec63c04]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-264873976]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3955178409]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2682103388]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1389954846]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3966136162]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-623118580]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1206723911]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2878735383]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3551266185]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-913847509]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1295087155]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0804f942992ebc02c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09a678c8caf144391]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e41d60022cbc5114]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01daf4f303959e2e3]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a4c18534e71b48cd]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-0371d62acdb5c377f]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-02a7f82951a37d6a21080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0b3430fd140be6e101080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c45d88270052c97a1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=flask-cluster]
module.eks.aws_eks_identity_provider_config.this["sts"]: Refreshing state... [id=flask-cluster:sts]
data.aws_eks_cluster_auth.default: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-01-25T23:42:17Z]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
data.aws_eks_cluster_auth.default: Read complete after 0s [id=flask-cluster]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::776410366842:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/0D66822D8F6B1186E94D67304D79C544]
module.eks.module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-07cf1b78cb7204d6e]
module.eks.module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=flask-cluster:general-20240125234217695000000013]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=flask-cluster:coredns]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=flask-cluster:vpc-cni]
module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=flask-cluster:kube-proxy]
module.external_dns_irsa_role.data.aws_region.current: Reading...
module.external_dns_irsa_role.data.aws_caller_identity.current: Reading...
module.cert_manager_irsa_role.data.aws_region.current: Reading...
module.cert_manager_irsa_role.data.aws_caller_identity.current: Reading...
module.external_dns_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.cert_manager_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.external_dns_irsa_role.data.aws_partition.current: Reading...
module.cert_manager_irsa_role.data.aws_partition.current: Reading...
module.external_dns_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.cert_manager_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.external_dns_irsa_role.data.aws_iam_policy_document.external_dns[0]: Reading...
module.cert_manager_irsa_role.data.aws_caller_identity.current: Read complete after 0s [id=776410366842]
module.external_dns_irsa_role.data.aws_iam_policy_document.external_dns[0]: Read complete after 0s [id=1299214504]
module.cert_manager_irsa_role.data.aws_iam_policy_document.cert_manager[0]: Reading...
module.cert_manager_irsa_role.data.aws_iam_policy_document.cert_manager[0]: Read complete after 0s [id=3351752651]
module.external_dns_irsa_role.aws_iam_policy.external_dns[0]: Refreshing state... [id=arn:aws:iam::776410366842:policy/AmazonEKS_External_DNS_Policy-20240125234849658800000018]
module.cert_manager_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.cert_manager_irsa_role.aws_iam_policy.cert_manager[0]: Refreshing state... [id=arn:aws:iam::776410366842:policy/AmazonEKS_Cert_Manager_Policy-20240125234849660800000019]
module.external_dns_irsa_role.data.aws_caller_identity.current: Read complete after 0s [id=776410366842]
module.cert_manager_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=943010701]
module.external_dns_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.cert_manager_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=cert-manager]
module.external_dns_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=40158983]
module.external_dns_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=external-dns]
module.cert_manager_irsa_role.aws_iam_role_policy_attachment.cert_manager[0]: Refreshing state... [id=cert-manager-2024012523485002470000001a]
module.external_dns_irsa_role.aws_iam_role_policy_attachment.external_dns[0]: Refreshing state... [id=external-dns-2024012523485002780000001b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = true
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.13.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "cert-manager"
        }
    }

  # helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "6.13.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "domainFilters"
          + value = "ev4o.com"
        }
      + set {
          + name  = "provider"
          + value = "aws"
        }
      + set {
          + name  = "registry"
          + value = "txt"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-dns"
        }
      + set {
          + name  = "sources"
          + value = "{ingress}"
        }
      + set {
          + name  = "txtOwnerId"
          + value = "Owner"
        }
      + set {
          + name  = "txtPrefix"
          + value = "prefix"
        }
    }

  # helm_release.nginx-ingress will be created
  + resource "helm_release" "nginx-ingress" {
      + atomic                     = true
      + chart                      = "nginx-ingress-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.7.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "publishService.enabled"
          + value = "true"
        }
      + set {
          + name  = "service.type"
          + value = "LoadBalancer"
        }
    }

  # kubernetes_service_account.cert-account will be created
  + resource "kubernetes_service_account" "cert-account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn"               = "arn:aws:iam::776410366842:role/cert-manager"
              + "eks.amazonaws.com/sts-regional-endpoints" = "true"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/component" = "cert-manager"
              + "app.kubernetes.io/name"      = "cert-manager"
            }
          + name             = "cert-manager"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.dns-account will be created
  + resource "kubernetes_service_account" "dns-account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn"               = "arn:aws:iam::776410366842:role/external-dns"
              + "eks.amazonaws.com/sts-regional-endpoints" = "true"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/component" = "external-dns"
              + "app.kubernetes.io/name"      = "external-dns"
            }
          + name             = "external-dns"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @eevlogiev, Action: `pull_request`*